; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v6)
             (pred_12 ?v13 ?v9)
             (pred_1 ?v4 ?v9)
             (pred_8 ?v1 ?v4 )
	     (pred_10 ?v4)
             (pred_9 ?v5)
             (pred_7 ?v13)
             (pred_3 ?v9)
             (pred_11 ?v4)
             (pred_5 ?v13)
             (pred_4 ?v4)
             (pred_2 ))



(:action op_3
:parameters (?v8 ?v2 ?v12 ?v11)
:precondition (and (pred_9 ?v8) (pred_9 ?v2) (pred_7 ?v12) (pred_3 ?v11)
          (pred_6 ?v8 ?v2) (pred_12 ?v12 ?v11)
                   (pred_1 ?v2 ?v11) (pred_10 ?v8) 
                   (pred_11 ?v2) (pred_5 ?v12))
:effect (and  (pred_4 ?v2) (not (pred_11 ?v2))))


(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_9 ?v8) (pred_9 ?v3)
               (pred_10 ?v8) (pred_6 ?v8 ?v3) (pred_4 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v8))))

(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_9 ?v8) (pred_7 ?v12) 
                  (pred_10 ?v8) (pred_8 ?v12 ?v8) (pred_2 ))
:effect (and (pred_5 ?v12)
   (not (pred_8 ?v12 ?v8)) (not (pred_2 ))))


(:action op_1
:parameters (?v8 ?v10 ?v7)
:precondition (and (pred_9 ?v8) (pred_7 ?v10) (pred_7 ?v7)
                  (pred_10 ?v8) (pred_5 ?v7) (pred_8 ?v10 ?v8))
:effect (and (pred_5 ?v10) (pred_8 ?v7 ?v8)
        (not (pred_5 ?v7)) (not (pred_8 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v12)
:precondition (and (pred_9 ?v8) (pred_7 ?v12) 
                  (pred_10 ?v8) (pred_5 ?v12))
:effect (and (pred_2 ) (pred_8 ?v12 ?v8) (not (pred_5 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_20 obj_09 obj_12 obj_07 obj_19 obj_04 obj_01 obj_15 obj_06 obj_18 obj_11 obj_02 obj_17 obj_16 obj_10
    obj_08 obj_14
    obj_05 obj_03
    )

    (:init
       (pred_2)

       (pred_9 obj_13)
       (pred_9 obj_20)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_19)
       (pred_9 obj_04)
       (pred_9 obj_01)
       (pred_9 obj_15)
       (pred_9 obj_06)
       (pred_9 obj_18)
       (pred_9 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_16)
       (pred_9 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_03)

       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_12)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_09)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_04)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_19)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_19)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_11)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_18)
       (pred_6 obj_02 obj_17)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_16)
       (pred_11 obj_09)
       (pred_11 obj_20)
       (pred_1  obj_09 obj_08)
       (pred_1  obj_20 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_07)
       (pred_4 obj_19)
       (pred_4 obj_04)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_06)
       (pred_4 obj_18)
       (pred_4 obj_11)
       (pred_4 obj_02)
       (pred_4 obj_17)
       (pred_4 obj_16)
       (pred_4 obj_10)

       (pred_12  obj_05 obj_08)
       (pred_12  obj_03 obj_14)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_03 obj_06)
       (pred_10 obj_07)
    )

    (:goal (and
       (pred_8 obj_03 obj_11)
    ))
(:constraints
  (always (not (pred_10 obj_18)))
)
)

; plan
1. (op_5 obj_07 obj_15)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_15)
   goals met: 0 of 1
2. (op_5 obj_15 obj_06)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_06)
   goals met: 0 of 1
3. (op_2 obj_06 obj_03)
   deleted: (pred_8 obj_03 obj_06) (pred_2)
   added: (pred_5 obj_03)
   goals met: 0 of 1
4. (op_5 obj_06 obj_19)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_04)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_04)
   goals met: 0 of 1
6. (op_5 obj_04 obj_01)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_11)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_03)
   deleted: (pred_5 obj_03)
   added: (pred_2) (pred_8 obj_03 obj_11)
   goals met: 1 of 1
